In [24]:
import pandas as pd
from sqlalchemy import create_engine
from config import pg_pwd


engine = create_engine(f"postgresql://postgres:{pg_pwd}@localhost:5432/Employee_db")

conn = engine.connect()

In [25]:
#with engine.connect() as conn, conn.begin():
salary_df = pd.read_sql_table("salaries", conn)

In [26]:
salary_df.describe()

              emp_no         salary
count  300024.000000  300024.000000
mean   253321.763392   52970.732451
std    161828.235540   14301.478491
min     10001.000000   40000.000000
25%     85006.750000   40000.000000
50%    249987.500000   48681.000000
75%    424993.250000   61758.000000
max    499999.000000  129492.000000

In [27]:
salary_df.loc[salary_df["emp_no"] == 499942]

        emp_no   salary
299966  499942  40000.0

In [30]:
# create age range bins
bins = [0, 19999.99, 39999.99, 59999.99, 79999.99, 99999.99, 119999.99, 150000.00]

# create bin text
salary_categories = ["<20K", "20K-39K", "40K-59K", "60K-79K", "80K-99K", "100K-119K", ">120K"]

# cut data into bins according to age, and add the age range column to the table
salary_df["salary_ranges"] = pd.cut(salary_df["salary"], bins, labels=salary_categories, include_lowest=False)
salary_df
# group data by age range and count the number of
# rows per range
binned_df = salary_df.groupby("salary_ranges").count()

binned_df

               emp_no  salary
salary_ranges
<20K                0       0
20K-39K             0       0
40K-59K        216380  216380
60K-79K         66227   66227
80K-99K         16129   16129
100K-119K        1264    1264
>120K              24      24